[{"start":1430946900,"duration":9900,"updates":[{"when":1430956800,"msg":"An unidentified failure caused persona to stop working in prod. Prod was rolled back to a previous deployment, and is now working again. User signups and password changes since 3pm PDT 4/20/15 were lost in the process."},{"when":1430946900,"msg":"Our database server has started misbehaving, it's under investigation. This is affecting users with the email fallback, as well as users on the mozilla idp."}]},{"start":1430411760,"duration":5640,"updates":[{"when":1430417400,"msg":"The email provider for persona.org was changed during a deployment on Tue 4/28/15. We have rolled back to our previous email provider."},{"when":1430411760,"msg":"Backend email has started seeing an issue, and has been disabled. This will prevent user signup on the fallback."}]},{"start":1412640180,"duration":14820,"updates":[{"when":1412655000,"msg":"Connectivity has been restored to our Pheonix datacenter. Persona is fully functioning again."},{"when":1412650800,"msg":"Our Pheonix datacenter continues to be unavailable. There has been a hardware failure on one of the core routers. Investigation by the Mozilla Network Operations Team is ongoing, and no ETA is available at this time."},{"when":1412640180,"msg":"Our Phoenix datacenter is inaccesisble resulting in writes to Persona being blocked. New user account signups and password changes are not working."}]},{"start":1404612000,"duration":1320,"updates":[{"when":1404613320,"msg":"Network maintenance in the datacenter broke the connection to the database master. The changes were reverted and connectivity was restored. Persona is fully functioning again."},{"when":1404612000,"msg":"Our Phoenix datacenter is inaccesisble resulting in writes to Persona being blocked. New user account signups and password changes are not working."}]},{"start":1404011895,"duration":6765,"updates":[{"when":1404018660,"msg":"Our frontend tier of has been repaired and Persona is back at full functionality."},{"when":1404012892,"msg":"A second webserver has begun failing taking the Persona service down completely. We are working to resolve the issue."},{"when":1404011895,"msg":"The disks on one of our frontend web servers has filled resulting in half of Persona traffic receiving 503 errors."}]},{"start":1403773932,"duration":2628,"updates":[{"when":1403776560,"msg":"Database replication issues have been resolved and all Persona services are at full functionality."},{"when":1403776020,"msg":"Persona webservers have been fixed and Persona service is back up globally. Database replication issues persist as mentioned previously."},{"when":1403775252,"msg":"A second webserver has begun failing taking the Persona service down completely. We are working to resolve the issue."},{"when":1403773932,"msg":"The disks on one of our frontend web servers has filled resulting in half of Persona traffic receiving 503 errors."}]},{"start":1403754712,"duration":21848,"updates":[{"when":1403776560,"msg":"Database replication issues have been resolved and all Persona services are at full functionality."},{"when":1403754712,"msg":"One of our DB slaves' disk has filled resulting in a break in slave replication. Half of all Persona traffic is using an old view of the data. Any new accounts or password changes made after this point in time will not be available in Persona half of the time. Working to resolve the problem now."}]},{"start":1401298380,"duration":13200,"updates":[{"when":1401311580,"msg":"The intermittent network issues appear to have been resolved"},{"when":1401298380,"msg":"Internet connectivity between some sites and Persona are showing intermittent timeouts. This appears to be affecting traffic from Level3 originating out of Honk Kong, Sydney, Signapore and Miami. This is manifesting as timeouts when users with @yahoo.com and @gmail.com email addresses try to log in."}]},{"start":1397063370,"duration":18510,"updates":[{"when":1397081880,"msg":"A new certificate has been created and deployed re-enabling all gmail and yahoo users in Persona."},{"when":1397063370,"msg":"Persona logins for all users with gmail and yahoo email addresses have stopped working. This is due to an unintentional certificate revocation. We are generating a new certificate and will have the service back up shortly."}]},{"start":1395440040,"duration":4034,"updates":[{"when":1395444074,"msg":"Service has been restored and Persona is fully functional again."},{"when":1395440040,"msg":"Outbound emails have stopped sending for all new accounts and password resets."}]},{"start":1391508420,"duration":1176,"updates":[{"when":1391509596,"msg":"Service has been restored and Persona is fully functional again."},{"when":1391508420,"msg":"Maintenace being performed by our internet connectivity provider unexpectedly caused an interuption of connectivity at one of our datacenters. This resulted in password change and new acount signups to be unavailable for 50% of users. https://status.mozilla.org/en-US/detail/41/"}]},{"start":1390889760,"duration":26040,"updates":[{"when":1390915800,"msg":"Space was cleared and services restarted on the affected hosts restoring full services to Persona."},{"when":1390889760,"msg":"Disks began to fill on a handful of very old systems resulting in intermittent errors when logging in for 25% of users."}]},{"start":1390871340,"duration":480,"updates":[{"when":1390871820,"msg":"@yahoo.com and @gmail.com Persona logins have been restored to full function."},{"when":1390871340,"msg":"An operational process issue resulted in decomissioning the infrastucture supporting both the yahoo and google identity bridges which has caused Persona logins for users with @yahoo.com and @gmail.com email addresses to fail."}]},{"start":1389820920,"duration":1080,"updates":[{"when":1389822000,"msg":"The issue has been resolved and traffic re-enabled at all datacenters. Persona is functioning normally again."},{"when":1389820920,"msg":"While fixing the root cause of the issue, 12.5% of users service was again disrupted."}]},{"start":1389807600,"duration":12261,"updates":[{"when":1389819861,"msg":"Traffic has been disabled at the affected datacenter. Persona is functioning normally again."},{"when":1389807600,"msg":"Some servers in our Oregon datacenter are returning 500's causing a disruption in Persona service for 6.25% of users."}]},{"start":1389732300,"duration":6720,"updates":[{"when":1389739020,"msg":"The failing availability zone has been removed from service. Persona service has been restored."},{"when":1389732300,"msg":"One availability zone in one of our datacenters is causing HTTP 500 errors in Persona. This is affecting 12.5% of Persona traffic."}]},{"start":1388531280,"duration":1860,"updates":[{"when":1388533140,"msg":"Replication has been re-established and Persona is functioning normally again."},{"when":1388531280,"msg":"One database in our Oregon datacenter has lost replication with the rest of the databases. New users or users who are changing their password may experience intermittent issues while we re-establish replication."}]},{"start":1387737035,"duration":330205,"updates":[{"when":1388067240,"msg":"Our third party email provider has worked around the issue on their side and are following up with Microsoft to determine how to prevent this. All emails have flushed through and are now being delivered in real time."},{"when":1387737035,"msg":"Microsoft has begun deferring inbound emails that our third party email provider is sending them. We're investigating to the best of our ability the rationale behind this change. This will affect new users with email addresses at Microsoft controlled email accounts such as hotmail.com, live.com, outlook.com and others. This affects new user signups and password recovery emails for users with email addresses at Microsoft domains."}]},{"start":1387143300,"duration":720,"updates":[{"when":1387144020,"msg":"Maintenance complete"},{"when":1387143300,"msg":"Planned maintenance will be blocking new user accounts and password changes for the next 30 minutes"}]},{"start":1386514020,"duration":3600,"updates":[{"when":1386517620,"msg":"Replication was re-established on the database and all transactions were carried over. Persona functionality is back to 100%"},{"when":1386514020,"msg":"One database slave in one datacenter lost it's ability to replicate data in the Persona system. This would result in the potential scenario where a user changed their password or created a new account and then wasn't able to login after they had done so."}]},{"start":1381047840,"duration":1080,"updates":[{"when":1381048920,"msg":"This maintenance is complete and writes are re-enabled."},{"when":1381047840,"msg":"In order to resolve the repeated database failures we're going to take the server down to replace the bad hardware. This will result in a roughly 15 minute window during which password changes and new user account setups will not work."}]},{"start":1380940860,"duration":600,"updates":[{"when":1380941460,"msg":"Database replication has been restored."},{"when":1380940860,"msg":"Writes to Persona have stopped working. Password changes and new user account setups are not working. This is being caused by a hardware restart of our global master database"}]},{"start":1380783360,"duration":900,"updates":[{"when":1380784260,"msg":"Database replication has been restored."},{"when":1380783360,"msg":"Writes to Persona have stopped working. Password changes and new user account setups are not working. This is being caused by a hardware restart of our global master database"}]},{"start":1380270537,"duration":1623,"updates":[{"when":1380272160,"msg":"Database replication has been restored."},{"when":1380270960,"msg":"Database writes have been restored but there is replication lag between regions. This will result in possible inconsistent user experience for users with recently changed passwords and new user accounts."},{"when":1380270537,"msg":"Writes to Persona have stopped working. Password changes and new user account setups are not working. This is being caused by a hardware restart of our global master database"}]},{"start":1375683600,"duration":11820,"updates":[{"when":1375695420,"msg":"Service was restored"},{"when":1375683600,"msg":"Traffic to https://browserid.org/ and https://persona.org/ was interupted. This only affected users typing root zones into their browsers and relying parties using the  old https://browserid.org/verify URL for verification (instead of https://verifier.login.persona.org/verify ). https://login.persona.org was functioning fine during this window."}]},{"start":1373925720,"duration":80280,"updates":[{"when":1374006000,"msg":"Due to a monitoring bug this database replication problem was not detected until now. We drained all traffic from the affected datacenter while the problem is fixed. Persona site functionality is now back to 100%"},{"when":1373986320,"msg":"A second database host's disk filled due to a volume mounting issue. 33.3% of db requests are going to a database  that is not receiving replication updates."},{"when":1373925720,"msg":"One database host's disk filled due to a volume mounting issue. 16.6% of db requests are going to a database  that is not receiving replication updates which could result in unusual behavior such as a user changing a password but intermittently not being able to log in with the new password."}]},{"start":1373870580,"duration":360,"updates":[{"when":1373870940,"msg":"Service was restored to persona.org and browserid.org following the server reboot.  We will mitigate this risk going forward by either changing our DNS load balancing provider to enable root zone DNS load balancing of AWS load balancer DNS CNAMEs or build our own hot swappable root zone system."},{"when":1373870580,"msg":"Service at persona.org and browserid.org was interupted due to a server reboot.  This service interuption only affected the legacy URLs for Persona (e.g. https://browserid.org/ and https://persona.org/ ).  All sites using the current API endpoints ( https://verifier.login.persona.org/verify and https://login.persona.org/include.js ) were unaffected. Users using the current site ( https://login.persona.org ) were also unaffected."}]},{"start":1368170340,"duration":47700,"updates":[{"when":1368218040,"msg":"Traffic was drained from the affected datacenter returning persona service to normal. Subsequently data replication was repaired and traffic was re-enabled at the affected datacenter."},{"when":1368170340,"msg":"Network issues at our SCL2 datacenter has blocked data replication between our PHX1 and SCL2 datacenters.  This means that if during this outage someone changed their password or created an account hitting the PHX1 datacenter,  they would not have been able to login at the SCL2 datacenter (if DNS sent them there) until after the outage. SCL2 incorrectly had traffic being sent to it sporadically from 9:18 AM PDT to 10:37 AM PDT and then consistently from 10:37 AM PDT to 1:34 PM PDT. It's during these windows that the above potential problem would have been exhibited."}]},{"start":1366099620,"duration":3780,"updates":[{"when":1366103400,"msg":"Traffic was drained from the affected datacenter returning persona service to normal"},{"when":1366099620,"msg":"A fiber cut on one of our network transit providers interupted write access in Persona at one of our two datacenters (no new user signups, no password changes, etc.)."}]},{"start":1364664900,"duration":720,"updates":[{"when":1364665620,"msg":"PHX1 network connectivity was re-established, re-enabling write access."},{"when":1364664900,"msg":"Network maintenance at the PHX1 datacenter disabled write access in Persona globally (no new user signups, no password changes, etc.)."}]},{"start":1362988740,"duration":240,"updates":[{"when":1362988980,"msg":"Our PHX1 datacenter has been re-enabled in DNS and is accepting traffic. Persona is now again 100% available."},{"when":1362988740,"msg":"An unknown problem caused our DNS provider to drain traffic from our PHX1 datacenter. Since we'd blocked traffic to our SCL2 datacenter while we repaired the hardware failure, the loss of our second datacenter resulted in persona being unavailable."}]},{"start":1362945316,"duration":584,"updates":[{"when":1362945900,"msg":"Traffic has been drained from the affected datacenter. All persona services are again 100% available. Once the problem is resolved we will re-enable traffic at this location."},{"when":1362945316,"msg":"A hardware failure in a host in our SCL2 datacenter has interupted persona service at this location. 50% of users will experience issues accessing persona."}]},{"start":1362695035,"duration":2400,"updates":[{"when":1362697435,"msg":"Our email vendor moved us to an alternative delivery infrastructure after they confirmed the delays in email delivery. All email is flowing normally now. We are waiting on word back from them identifying when the problem began."},{"when":1362695035,"msg":"Persona email delivery is delayed due to hardware issues on our email vendor's infrastructure."}]},{"start":1362614988,"duration":960,"updates":[{"when":1362615948,"msg":"The network issue has been resolved. We will re-enable the SCL2 datacenter shortly"},{"when":1362615120,"msg":"We have drained traffic from the affected datacenter and all users are now unaffected."},{"when":1362614988,"msg":"A network issue at our SCL2 datacenter caused blocked connectivity between our dbwriter tier and the db master, preventing writes to the database for all users hitting the SCL2 datacenter. This resulted in 50% of users being unable to change their password or sign up. Sign-ins were unaffected."}]},{"start":1362364697,"duration":172,"updates":[{"when":1362364869,"msg":"The network issue was resolved and connectivity restored. https://bugzilla.mozilla.org/show_bug.cgi?id=846485#c17"},{"when":1362364697,"msg":"A network issue at our SCL2 datacenter caused blocked connectivity between our dbwriter tier and the db master, preventing writes to the database for all users hitting the SCL2 datacenter. Users hitting the PHX1 datacenter are unaffected."}]},{"start":1362087960,"duration":2520,"updates":[{"when":1362090480,"msg":"Now that the network has stabilized traffic has been re-enabled at the SCL2 datacenter."},{"when":1362088320,"msg":"Drained all traffic from the affected datacenter, re-enabling writes to all users. https://bugzilla.mozilla.org/show_bug.cgi?id=846485"},{"when":1362087960,"msg":"A network issue at our SCL2 datacenter caused blocked connectivity between our dbwriter tier and the db master, preventing writes to the database."}]},{"start":1361304707,"duration":5653,"updates":[{"when":1361310360,"msg":"Now that the site has stabilized, we've re-enabled traffic at the SCL2 datacenter."},{"when":1361305020,"msg":"Network issue resolved itself causing the dbwriter tier to become available again. We drained traffic for browserid.org at SCL2 between 12:13 and 12:16 but failed to drain traffic for presona.org. This was subsequently drained at 12:29. We will monitor the situation and bring traffic back to the SLC2 site when it appears safe. https://bugzilla.mozilla.org/show_bug.cgi?id=842707"},{"when":1361304707,"msg":"A network issue at our SCL2 datacenter caused the dbwriter tier to go down, preventing writes to the database."}]},{"start":1357245360,"duration":7260,"updates":[{"when":1357252620,"msg":"All queued gmail.com emails were delivered over the course of the last two minutes.  We recently moved production email to a new, isolated account, and all new accounts have throttling in place by default: a maximum of 50 emails per domain per hour were sent, and the rest were queued until the following hour. A combination of real user emails and Selenium tests pushed us well over the limit for the gmail.com domain.  After our ticket was filed, an engineer at our email service removed the throttling from our new account, and the gmail queue was cleared rapidly.  While we're confident we have isolated the cause of the incident, this is still a preliminary timeline. The actual duration is still unknown. We will update this timeline as soon as possible."},{"when":1357251360,"msg":"Cause isolated - email delivery to gmail.com was blocked, with ~900 emails in queue. This affected selenium tests but, more importantly, production users as well."},{"when":1357245360,"msg":"Selenium tests that rely on email began to fail."}]},{"start":1355350080,"duration":660,"updates":[{"when":1355350740,"msg":"Maintenance complete and the system is back to full function"},{"when":1355350080,"msg":"We made DB changes to improve the stability of the system. During this time new user signups could be impacted."}]},{"start":1355349780,"duration":60,"updates":[{"when":1355349840,"msg":"DB writes were re-enabled bringing the system back to full functionality"},{"when":1355349780,"msg":"We stopped db writes during our maintenance window for just under 1 minute. This outage was briefer than we had anticipated. This maintneance was done to improve the stability of the system."}]},{"start":1354228020,"duration":1920,"updates":[{"when":1354229940,"msg":"Service restored by routing traffic from Phoenix to Santa Clara.  Planned maintenance led to unexpected load balancer downtime in the Phoenix datacenter, causing intermittent outages."},{"when":1354229340,"msg":"Mozilla Marketplace logins reported as failing in IRC"},{"when":1354228380,"msg":"Nagios reports failures at Phoenix datacenter"},{"when":1354228020,"msg":"Watchmouse begins reporting intermittent failures to reach the site."}]},{"start":1352324100,"duration":120,"updates":[{"when":1352324220,"msg":"Datacenter connectivity restored."},{"when":1352324100,"msg":"Connectivity between datacenters interrupted again; same impact as the earlier Nov 7 outage."}]},{"start":1352304240,"duration":180,"updates":[{"when":1352304420,"msg":"Datacenter connectivity restored."},{"when":1352304240,"msg":"Our Santa Clara and Phoenix datacenters lost connectivity due to a network carrier failure. DB writers in Santa Clara were removed from service, impacting user traffic for 50% of users. Affected users were not able to create accounts, verify new accounts, or access management page features."}]},{"start":1351619700,"duration":9480,"updates":[{"when":1351629180,"msg":"Persona was rolled back to the previous version, fixing API problems.  During this 2.5 hour window, some sites using Persona could have appeared broken in an infinite refresh loop, depending on how they were implemented."},{"when":1351624980,"msg":"A community member reported that a persona site was broken, in an infinite refresh loop."},{"when":1351619700,"msg":"A new version of the persona service was deployed, containing an undetected API regression."}]},{"start":1348130290,"duration":925,"updates":[{"when":1348131215,"msg":"Email delivery repaired - we'll work with our vendor to discover and resolve underlying cause."},{"when":1348130290,"msg":"Slow email delivery detected."}]},{"start":1347999667,"duration":30,"updates":[{"when":1347999697,"msg":"Live alter of schema did not progress as expected, aborted after 30s.  Again, we will regroup."},{"when":1347999667,"msg":"A second attempt at live altering of schema.  Allowing a maximum of 30 seconds of partial downtime (only affecting new user signups and email verifications)."}]},{"start":1347992467,"duration":550,"updates":[{"when":1347993017,"msg":"Allowed downtime duration elapsed,  Database update did not progress as expected, change was aborted.  We will re-group and perform this maintenence in a different way."},{"when":1347992467,"msg":"Beginning a planned partial outage to update database schema.  During this period new user signups and verifications will fail, but the rest of the service will function normally.  Expecting ~3 minutes of outage.  Maximum outage 10 minutes."}]},{"start":1344934708,"duration":1180,"updates":[{"when":1344935888,"msg":"dbwriters database connection dropped due to errant load balancer configuration, introduced by human error.  Situation resolved and service is fully restored."},{"when":1344935528,"msg":"Cause isolated - dbwqriters in SCL2 colo have no connection to database..."},{"when":1344934708,"msg":"A partial outage was discovered in one of our colocation facilities. New user sign up and verification of email links is not working properly for a half of users.  Investigating..."}]}]